testApi/app/controllers/scores_controller.rb

SELECT "scores".* FROM "scores"
---
   def index
    @scores = Score.all.sort

SELECT  "scores".* FROM "scores" WHERE "scores"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @score = Score.find_by(id: params[:id])

INSERT INTO "scores" ("score", "game", "player_id", "created_at", "updated_at", "name") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["score", 66], ["game", "test"], ["player_id", 1], ["created_at", "2019-06-03 13:43:04.245769"], ["updated_at", "2019-06-03 13:43:04.245769"], ["name", "keo"]]
---
  def create
    @response = {
  "payload": {
    "google": {
      "expectUserResponse": true,
      "richResponse": {
        "items": [
          {
            "simpleResponse": {
              "textToSpeech": "as you wish"
            }
          }
        ]
      }
    }
  }
}
    # @score = Score.create(score: params[:score], game: params[:game], player_id: params[:player_id], name: params[:name])
    #   render json: @score.to_json
      @score = Score.create(score: params["queryResult"]["parameters"]["number"], game: "test", player_id: 1, name: "keo")